---
title: MEPAnalyticalSegment
classe: Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# MEPAnalyticalSegment

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Area { get; }` | `mEPAnalyticalSegment.Area` | Double |
| `Double DemandFlow { get; }` | `mEPAnalyticalSegment.DemandFlow` | Double |
| `ConnectorDomainType DomainType { get; }` | `mEPAnalyticalSegment.DomainType` | ConnectorDomainType |
| `Int32 EndNode { get; }` | `mEPAnalyticalSegment.EndNode` | Int32 |
| `Int32 Id { get; }` | `mEPAnalyticalSegment.Id` | Int32 |
| `Double InnerDiameter { get; }` | `mEPAnalyticalSegment.InnerDiameter` | Double |
| `Boolean IsValidObject { get; }` | `mEPAnalyticalSegment.IsValidObject` | Boolean |
| `ElementId RevitElementId { get; }` | `mEPAnalyticalSegment.RevitElementId` | ElementId |
| `Double Roughness { get; }` | `mEPAnalyticalSegment.Roughness` | Double |
| `MEPAnalyticalSegmentType SegmentType { get; }` | `mEPAnalyticalSegment.SegmentType` | MEPAnalyticalSegmentType |
| `Int32 StartNode { get; }` | `mEPAnalyticalSegment.StartNode` | Int32 |
| `Void Dispose()` | `mEPAnalyticalSegment.Dispose()` | Void |
| `MEPNetworkSegmentId GetNetworkSegmentId()` | `mEPAnalyticalSegment.GetNetworkSegmentId()` | MEPNetworkSegmentId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```